function y=VSIP (u,fun_par)
% vehicle side imapct problem
% input m*n ，m为数据点数；n为x的维数
% fun_par =[] 无需求 
% output y为列向量

% 将标准正态变量u转化

    
    [Ns,Ndim] = size(u);
    
    muX = [1.38 1.38 1.38 1.38 0.3 0 0];
    sigmaX = [0.3 0.3 0.3 0.3 0.06 10 10];
    
    X = zeros(Ns,Ndim);
    for n = 1:Ndim
        X(:,n) = u(:,n)*sigmaX(n) + muX(n);
    end

  x1=X(:,1);x2=X(:,2);x3=X(:,3);
  x4=X(:,4);x5=X(:,5);x6=X(:,6);x7=X(:,7);

% ----------------------------功能函数--------------------------------------

  y = 0.489*x1.*x4+0.843*x2.*x3-0.0432*x5.*x6+0.0556*x5.*x7+0.000786*x7.^2-0.75;
  
% -------------------------------------------------------------------------

return